#!/bin/bash

declare -A lettersArray=(
	['q']="й" ['Q']="Й"    ['a']="ф" ['A']="Ф"    ['z']="я" ['Z']="Я"    ['`']="ё" ['~']="Ё"
	['w']="ц" ['W']="Ц"    ['s']="ы" ['S']="Ы"    ['x']="ч" ['X']="Ч"    ['@']='"'
	['e']="у" ['E']="У"    ['d']="в" ['D']="В"    ['c']="с" ['C']="С"    ['#']="№"
	['r']="к" ['R']="К"    ['f']="а" ['F']="А"    ['v']="м" ['V']="М"    ['$']=";"
	['t']="е" ['T']="Е"    ['g']="п" ['G']="П"    ['b']="и" ['B']="И"    ['^']=":"
	['y']="н" ['Y']="Н"    ['h']="р" ['H']="Р"    ['n']="т" ['N']="Т"    ['&']="?"
	['u']="г" ['U']="Г"    ['j']="о" ['J']="О"    ['m']="ь" ['M']="Ь"    ['?']=","
	['i']="ш" ['I']="Ш"    ['k']="л" ['K']="Л"    [',']="б" ['<']="Б"    ['/']="."
	['o']="щ" ['O']="Щ"    ['l']="д" ['L']="Д"    ['.']="ю" ['>']="Ю"
	['p']="з" ['P']="З"    [';']="ж" [":"]="Ж"    ['/']="." ['?']=","
	['[']="х" ['{']="Х"    ["'"]="э" ['"']="Э"
	[']']="ъ" ['}']="Ъ"
)

letters=""

readarray -t words <<<"$( xclip -o | grep -o '.')"
for letter in "${words[@]}"; do
    if [ "${lettersArray[$letter]}" = "" ] || [ "$letter" = " " ]; then
        letters="$letters""$letter"
    else
        letters="$letters${lettersArray[$letter]}"
    fi
done

printf "$letters" | xclip -selection clipboard;
xdotool key "ctrl+v"

